USE ry;

-- 插入气象数据表数据
INSERT INTO MeteorologicalData (temperature, humidity, wind_speed, rainfall, snowfall, extreme_weather_warning, dept_id) VALUES
(23.5, 60, 15, 0, 0, '无', 1),
(24.0, 55, 10, 0, 0, '无', 1),
(22.0, 70, 20, 0, 0, '无', 1),
(25.5, 65, 18, 0, 0, '无', 1),
(26.0, 58, 12, 0, 0, '无', 1),
(27.0, 50, 14, 0, 0, '无', 1),
(28.5, 45, 11, 0, 0, '无', 1),
(29.0, 40, 13, 0, 0, '无', 1),
(30.0, 35, 16, 0, 0, '无', 1),
(31.5, 30, 17, 0, 0, '无', 1);

-- 插入交通状态数据表数据
INSERT INTO TrafficStatus (traffic_volume, average_speed, congestion_description, vehicle_type_distribution, dept_id) VALUES
(1200, 60, '畅通', '轿车:60%, 卡车:20%, 摩托车:20%', 2),
(1300, 58, '轻微拥堵', '轿车:55%, 卡车:25%, 摩托车:20%', 2),
(1400, 55, '拥堵', '轿车:50%, 卡车:30%, 摩托车:20%', 2),
(1500, 50, '严重拥堵', '轿车:45%, 卡车:35%, 摩托车:20%', 2),
(1600, 45, '非常严重拥堵', '轿车:40%, 卡车:40%, 摩托车:20%', 2),
(1700, 40, '交通瘫痪', '轿车:35%, 卡车:45%, 摩托车:20%', 2),
(1800, 35, '交通瘫痪', '轿车:30%, 卡车:50%, 摩托车:20%', 2),
(1900, 30, '交通瘫痪', '轿车:25%, 卡车:55%, 摩托车:20%', 2),
(2000, 25, '交通瘫痪', '轿车:20%, 卡车:60%, 摩托车:20%', 2),
(2100, 20, '交通瘫痪', '轿车:15%, 卡车:65%, 摩托车:20%', 2);

-- 插入事故数据表数据
INSERT INTO AccidentData (accident_time, accident_location, accident_type, involved_vehicles,image, casualties, dept_id) VALUES
('2024-06-01 08:00:00', '路段A', '碰撞', '轿车2辆','https://q1.itc.cn/q_70/images01/20240917/b017c59a46e543dd9bd9aa9365cbfdaf.jpeg', 0, 3),
('2024-06-01 09:00:00', '路段B', '侧翻', '卡车1辆','https://media2.hndt.com/data_01/1/1/2022/08/04/54dff59aeba00b09a4c437abd11e3d39.jpg', 1,  3),
('2024-06-01 10:00:00', '路段C', '碾压', '摩托车1辆','https://p3.itc.cn/q_70/images03/20220924/289212dcbf8d47b996eb0552699b1451.png' ,0,  3),
('2024-06-01 11:00:00', '路段D', '追尾', '轿车3辆', 'https://nimg.ws.126.net/?url=http%3A%2F%2Fdingyue.ws.126.net%2F2024%2F1230%2F73873482j00spb1kx0019d000hs00cug.jpg&thumbnail=660x2147483647&quality=80&type=jpg',2,  3),
('2024-06-01 12:00:00', '路段E', '碰撞', '轿车1辆，卡车1辆', 'https://q1.itc.cn/q_70/images01/20240917/b017c59a46e543dd9bd9aa9365cbfdaf.jpeg',1, 3),
('2024-06-01 13:00:00', '路段F', '侧翻', '卡车2辆', 'https://media2.hndt.com/data_01/1/1/2022/08/04/54dff59aeba00b09a4c437abd11e3d39.jpg',0,  3),
('2024-06-01 14:00:00', '路段G', '碾压', '摩托车2辆', 'https://p3.itc.cn/q_70/images03/20220924/289212dcbf8d47b996eb0552699b1451.png',1,  3),
('2024-06-01 15:00:00', '路段H', '追尾', '轿车4辆', 'https://nimg.ws.126.net/?url=http%3A%2F%2Fdingyue.ws.126.net%2F2024%2F1230%2F73873482j00spb1kx0019d000hs00cug.jpg&thumbnail=660x2147483647&quality=80&type=jpg',2,  3),
('2024-06-01 16:00:00', '路段I', '碰撞', '轿车1辆，摩托车1辆', 'https://q1.itc.cn/q_70/images01/20240917/b017c59a46e543dd9bd9aa9365cbfdaf.jpeg',0,  3),
('2024-06-01 17:00:00', '路段J', '侧翻', '卡车1辆，摩托车1辆', 'https://media2.hndt.com/data_01/1/1/2022/08/04/54dff59aeba00b09a4c437abd11e3d39.jpg',1,  3);

-- 插入交通管制数据表数据
INSERT INTO TrafficControl (control_start_time, control_end_time, control_location, control_reason, dept_id) VALUES
('2024-06-01 07:00:00', '2024-06-01 09:00:00', '路段A', '事故处理', 3),
('2024-06-01 08:00:00', '2024-06-01 10:00:00', '路段B', '施工作业', 3),
('2024-06-01 09:00:00', '2024-06-01 11:00:00', '路段C', '极端天气', 3),
('2024-06-01 10:00:00', '2024-06-01 12:00:00', '路段D', '事故处理', 3),
('2024-06-01 11:00:00', '2024-06-01 13:00:00', '路段E', '施工作业', 3),
('2024-06-01 12:00:00', '2024-06-01 14:00:00', '路段F', '极端天气', 3),
('2024-06-01 13:00:00', '2024-06-01 15:00:00', '路段G', '事故处理', 3),
('2024-06-01 14:00:00', '2024-06-01 16:00:00', '路段H', '施工作业', 3),
('2024-06-01 15:00:00', '2024-06-01 17:00:00', '路段I', '极端天气', 3),
('2024-06-01 16:00:00', '2024-06-01 18:00:00', '路段J', '事故处理', 3);

-- 插入维护和施工信息表数据
INSERT INTO MaintenanceInfo (maintenance_start_time, maintenance_end_time, maintenance_location, maintenance_type, dept_id) VALUES
('2024-06-02 06:00:00', '2024-06-02 18:00:00', '路段X', '路面修复', 2),
('2024-06-03 06:00:00', '2024-06-03 18:00:00', '路段Y', '桥梁维护', 2),
('2024-06-04 06:00:00', '2024-06-04 18:00:00', '路段Z', '路面修复', 2),
('2024-06-05 06:00:00', '2024-06-05 18:00:00', '路段AA', '桥梁维护', 2),
('2024-06-06 06:00:00', '2024-06-06 18:00:00', '路段AB', '路面修复', 2),
('2024-06-07 06:00:00', '2024-06-07 18:00:00', '路段AC', '桥梁维护', 2),
('2024-06-08 06:00:00', '2024-06-08 18:00:00', '路段AD', '路面修复', 2),
('2024-06-09 06:00:00', '2024-06-09 18:00:00', '路段AE', '桥梁维护', 2),
('2024-06-10 06:00:00', '2024-06-10 18:00:00', '路段AF', '路面修复', 2),
('2024-06-11 06:00:00', '2024-06-11 18:00:00', '路段AG', '桥梁维护', 2);

-- 插入紧急事件数据表数据
INSERT INTO EmergencyEvents (event_time, event_type, event_location, event_description,image, dept_id) VALUES
('2024-06-01 07:30:00', '车辆故障', '路段1', '一辆轿车在路段1发生故障，等待救援。', 'https://pic.rmb.bdstatic.com/bjh/news/23f308003ea0fed4d5ca4530cced8890.jpeg',4),
('2024-06-01 08:45:00', '货物泄漏', '路段2', '一辆卡车在路段2泄漏货物，影响交通。', 'https://pic.rmb.bdstatic.com/bjh/news/3bd1e302ccd059d1fcb6b1e48d901ea6.jpeg',4),
('2024-06-01 10:00:00', '火灾', '路段3', '路段3发生火灾，紧急疏散。', 'https://p9.itc.cn/images01/20200524/47c08ab59dbf4483b31f167e787efa0e.jpeg',4),
('2024-06-01 11:15:00', '交通事故', '路段4', '两辆轿车在路段4相撞，有人员受伤。', 'https://pic.rmb.bdstatic.com/bjh/news/23f308003ea0fed4d5ca4530cced8890.jpeg',4),
('2024-06-01 12:30:00', '道路坍塌', '路段5', '路段5发生道路坍塌，交通中断。', 'https://p5.itc.cn/q_70/images03/20200823/e3e7bc4ed8834149a09ad96d1626d165.jpeg',4),
('2024-06-01 13:45:00', '洪水', '路段6', '路段6因洪水导致交通管制。', 'https://nimg.ws.126.net/?url=http%3A%2F%2Fdingyue.ws.126.net%2F2024%2F0720%2F6afc39e5j00sgvt8z0018d000hs00d9m.jpg&thumbnail=660x2147483647&quality=80&type=jpg',4),
('2024-06-01 15:00:00', '风暴', '路段7', '风暴导致路段7树木倒塌，道路封闭。', 'https://5b0988e595225.cdn.sohucs.com/images/20180517/64690da340644e6288eb4a88d7a5beff.jpeg',4),
('2024-06-01 16:15:00', '恐怖袭击', '路段8', '路段8发生恐怖袭击，紧急响应。', 'https://pic.rmb.bdstatic.com/bjh/news/3bd1e302ccd059d1fcb6b1e48d901ea6.jpeg',4),
('2024-06-01 17:30:00', '化工厂泄漏', '路段9', '化工厂在路段9泄漏，需紧急处理。', 'https://pic.rmb.bdstatic.com/bjh/news/3bd1e302ccd059d1fcb6b1e48d901ea6.jpeg',4),
('2024-06-01 18:45:00', '地震', '路段10', '地震导致路段10建筑物损坏，交通管制。', 'https://pic.rmb.bdstatic.com/bjh/news/3bd1e302ccd059d1fcb6b1e48d901ea6.jpeg',4);